# Azure Pentesting

{% hint style="success" %}
AWS Hacking рд╕реАрдЦреЗрдВ рдФрд░ рдЕрднреНрдпрд╛рд╕ рдХрд░реЗрдВ:<img src="/.gitbook/assets/image.png" alt="" data-size="line">[**HackTricks Training AWS Red Team Expert (ARTE)**](https://training.hacktricks.xyz/courses/arte)<img src="/.gitbook/assets/image.png" alt="" data-size="line">\
GCP Hacking рд╕реАрдЦреЗрдВ рдФрд░ рдЕрднреНрдпрд╛рд╕ рдХрд░реЗрдВ: <img src="/.gitbook/assets/image (2).png" alt="" data-size="line">[**HackTricks Training GCP Red Team Expert (GRTE)**<img src="/.gitbook/assets/image (2).png" alt="" data-size="line">](https://training.hacktricks.xyz/courses/grte)

<details>

<summary>HackTricks рдХреЛ рд╕рдорд░реНрдерди рджреЗрдВ</summary>

* [**рд╕рджрд╕реНрдпрддрд╛ рдпреЛрдЬрдирд╛рдУрдВ**](https://github.com/sponsors/carlospolop) рдХреА рдЬрд╛рдБрдЪ рдХрд░реЗрдВ!
* **рд╢рд╛рдорд┐рд▓ рд╣реЛрдВ** ЁЯТм [**Discord рд╕рдореВрд╣**](https://discord.gg/hRep4RUj7f) рдпрд╛ [**telegram рд╕рдореВрд╣**](https://t.me/peass) рдпрд╛ **рд╣рдореЗрдВ** **Twitter** ЁЯРж рдкрд░ **рдлреЙрд▓реЛ рдХрд░реЗрдВ** [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **PRs рд╕рдмрдорд┐рдЯ рдХрд░рдХреЗ рд╣реИрдХрд┐рдВрдЧ рдЯреНрд░рд┐рдХреНрд╕ рд╕рд╛рдЭрд╛ рдХрд░реЗрдВ** [**HackTricks**](https://github.com/carlospolop/hacktricks) рдФрд░ [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos рдореЗрдВред

</details>
{% endhint %}

## рдореИрдВ рдЕрднреА рднреА AZURE METHODOLOGY рдмрдирд╛ рд░рд╣рд╛ рд╣реВрдБ

## Basic Information

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Azure Pentester/Red Team Methodology

рдПрдХ AZURE environment рдХрд╛ рдСрдбрд┐рдЯ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдпрд╣ рдЬрд╛рдирдирд╛ рдмрд╣реБрдд рдорд╣рддреНрд╡рдкреВрд░реНрдг рд╣реИ: рдХреМрди рд╕реЗ **services рдЙрдкрдпреЛрдЧ рдХрд┐рдП рдЬрд╛ рд░рд╣реЗ рд╣реИрдВ**, рдХреНрдпрд╛ **exposed** рд╣реЛ рд░рд╣рд╛ рд╣реИ, рдХрд┐рд╕рдХреЗ рдкрд╛рд╕ рдХрд┐рд╕ рдЪреАрдЬрд╝ рдХрд╛ **access** рд╣реИ, рдФрд░ рдЖрдВрддрд░рд┐рдХ Azure services рдФрд░ **external services** рдХреИрд╕реЗ рдЬреБрдбрд╝реЗ рд╣реБрдП рд╣реИрдВред

Red Team рдХреЗ рджреГрд╖реНрдЯрд┐рдХреЛрдг рд╕реЗ, **Azure environment рдХреЛ compromise рдХрд░рдиреЗ рдХрд╛ рдкрд╣рд▓рд╛ рдХрджрдо** рдХреБрдЫ **credentials** рдкреНрд░рд╛рдкреНрдд рдХрд░рдирд╛ рд╣реИ Azure AD рдХреЗ рд▓рд┐рдПред рдпрд╣рд╛рдБ рдХреБрдЫ рд╡рд┐рдЪрд╛рд░ рджрд┐рдП рдЧрдП рд╣реИрдВ рдХрд┐ рдпрд╣ рдХреИрд╕реЗ рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИ:

* github (рдпрд╛ рд╕рдорд╛рди) рдореЗрдВ **Leaks** - OSINT
* **Social** Engineering
* **Password** рдкреБрди: рдЙрдкрдпреЛрдЧ (password leaks)
* Azure-Hosted Applications рдореЗрдВ Vulnerabilities
* [**Server Side Request Forgery**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) metadata endpoint рддрдХ рдкрд╣реБрдВрдЪ рдХреЗ рд╕рд╛рде
* **Local File Read**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* `az cli` рдореЗрдВ **`accessTokens.json`** рдлрд╝рд╛рдЗрд▓ 2.30 рд╕реЗ рдкрд╣рд▓реЗ - Jan2022 - рдиреЗ **access tokens рдХреЛ рд╕реНрдкрд╖реНрдЯ рдкрд╛рда рдореЗрдВ рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд┐рдпрд╛**
* **`azureProfile.json`** рдлрд╝рд╛рдЗрд▓ рдореЗрдВ рд▓реЙрдЧ рдЗрди рдХрд┐рдП рдЧрдП рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ **рдЬрд╛рдирдХрд╛рд░реА** рд╣реЛрддреА рд╣реИред
* **`az logout`** token рдХреЛ рд╣рдЯрд╛ рджреЗрддрд╛ рд╣реИред
* **`Az PowerShell`** рдХреЗ рдкреБрд░рд╛рдиреЗ рд╕рдВрд╕реНрдХрд░рдгреЛрдВ рдиреЗ **access tokens** рдХреЛ **clear** рдкрд╛рда рдореЗрдВ **`TokenCache.dat`** рдореЗрдВ рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд┐рдпрд╛ред рдЗрд╕рдиреЗ **ServicePrincipalSecret** рдХреЛ **clear**-рдкрд╛рда рдореЗрдВ **`AzureRmContext.json`** рдореЗрдВ рднреА рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд┐рдпрд╛ред **`Save-AzContext`** cmdlet рдХрд╛ рдЙрдкрдпреЛрдЧ **tokens** рдХреЛ **store** рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИред\
рдЙрдиреНрд╣реЗрдВ рд╣рдЯрд╛рдиреЗ рдХреЗ рд▓рд┐рдП `Disconnect-AzAccount` рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВред
* 3rd parties **breached**
* **Internal** рдХрд░реНрдордЪрд╛рд░реА
* [**Common Phishing**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (credentials рдпрд╛ Oauth App)
* [Device Code Authentication Phishing](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [Azure **Password Spraying**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

рднрд▓реЗ рд╣реА рдЖрдкрдиреЗ рдЙрд╕ Azure tenant рдХреЗ рдЕрдВрджрд░ рдХрд┐рд╕реА рднреА рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЛ **compromise** рдирд╣реАрдВ рдХрд┐рдпрд╛ рд╣реИ рдЬрд┐рд╕реЗ рдЖрдк рдЕрдЯреИрдХ рдХрд░ рд░рд╣реЗ рд╣реИрдВ, рдЖрдк рдЙрд╕рд╕реЗ **рдХреБрдЫ рдЬрд╛рдирдХрд╛рд░реА рдПрдХрддреНрд░** рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
рдПрдХ рдмрд╛рд░ рдЬрдм рдЖрдк credentials рдкреНрд░рд╛рдкреНрдд рдХрд░ рд▓реЗрддреЗ рд╣реИрдВ, рддреЛ рдЖрдкрдХреЛ рдпрд╣ рдЬрд╛рдирдирд╛ рд╣реЛрдЧрд╛ рдХрд┐ **рд╡реЗ credentials рдХрд┐рд╕рдХреЗ рд╣реИрдВ**, рдФрд░ **рдЙрдирдХреЗ рдкрд╛рд╕ рдХрд┐рд╕ рдЪреАрдЬрд╝ рдХрд╛ access рд╣реИ**, рдЗрд╕рд▓рд┐рдП рдЖрдкрдХреЛ рдХреБрдЫ рдмреБрдирд┐рдпрд╛рджреА enumeration рдХрд░рдирд╛ рд╣реЛрдЧрд╛:
{% endhint %}

## Basic Enumeration

{% hint style="info" %}
рдпрд╛рдж рд░рдЦреЗрдВ рдХрд┐ enumeration рдХрд╛ **рд╕рдмрд╕реЗ рд╢реЛрд░рдЧреБрд▓ рд╡рд╛рд▓рд╛** рд╣рд┐рд╕реНрд╕рд╛ **login** рд╣реИ, рди рдХрд┐ enumeration рд╕реНрд╡рдпрдВред
{% endhint %}

### SSRF

рдпрджрд┐ рдЖрдкрдиреЗ Azure рдХреЗ рдЕрдВрджрд░ рдХрд┐рд╕реА рдорд╢реАрди рдореЗрдВ SSRF рдкрд╛рдпрд╛ рд╣реИ рддреЛ рдЗрд╕ рдкреЗрдЬ рдкрд░ рдЯреНрд░рд┐рдХреНрд╕ рджреЗрдЦреЗрдВ:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Login Conditions рдХреЛ Bypass рдХрд░реЗрдВ

<figure><img src="../../.gitbook/assets/image (268).png" alt=""><figcaption></figcaption></figure>

рдРрд╕реЗ рдорд╛рдорд▓реЛрдВ рдореЗрдВ рдЬрд╣рд╛рдВ рдЖрдкрдХреЗ рдкрд╛рд╕ рдХреБрдЫ рд╡реИрдз credentials рд╣реИрдВ рд▓реЗрдХрд┐рди рдЖрдк рд▓реЙрдЧрд┐рди рдирд╣реАрдВ рдХрд░ рд╕рдХрддреЗ, рдпреЗ рдХреБрдЫ рд╕рд╛рдорд╛рдиреНрдп рд╕реБрд░рдХреНрд╖рд╛ рдЙрдкрд╛рдп рд╣реЛ рд╕рдХрддреЗ рд╣реИрдВ:

* **IP whitelisting** -- рдЖрдкрдХреЛ рдПрдХ рд╡реИрдз IP рдХреЛ compromise рдХрд░рдирд╛ рд╣реЛрдЧрд╛
* **Geo restrictions** -- рдкрддрд╛ рд▓рдЧрд╛рдПрдВ рдХрд┐ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХрд╣рд╛рдБ рд░рд╣рддрд╛ рд╣реИ рдпрд╛ рдХрдВрдкрдиреА рдХреЗ рдХрд╛рд░реНрдпрд╛рд▓рдп рдХрд╣рд╛рдБ рд╣реИрдВ рдФрд░ рдЙрд╕реА рд╢рд╣рд░ (рдпрд╛ рдХрдо рд╕реЗ рдХрдо рджреЗрд╢) рд╕реЗ рдПрдХ IP рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ
* **Browser** -- рд╣реЛ рд╕рдХрддрд╛ рд╣реИ рдХрд┐ рдХреЗрд╡рд▓ рдПрдХ рдирд┐рд╢реНрдЪрд┐рдд OS (Windows, Linux, Mac, Android, iOS) рд╕реЗ рдмреНрд░рд╛рдЙрдЬрд╝рд░ рдХреА рдЕрдиреБрдорддрд┐ рд╣реЛред рдкрддрд╛ рд▓рдЧрд╛рдПрдВ рдХрд┐ рдкреАрдбрд╝рд┐рдд/рдХрдВрдкрдиреА рдХреМрди рд╕рд╛ OS рдЙрдкрдпреЛрдЧ рдХрд░рддреА рд╣реИред
* рдЖрдк **Service Principal credentials** рдХреЛ рднреА compromise рдХрд░рдиреЗ рдХрд╛ рдкреНрд░рдпрд╛рд╕ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ рдХреНрдпреЛрдВрдХрд┐ рд╡реЗ рдЖрдорддреМрд░ рдкрд░ рдХрдо рд╕реАрдорд┐рдд рд╣реЛрддреЗ рд╣реИрдВ рдФрд░ рдЙрдирдХрд╛ рд▓реЙрдЧрд┐рди рдХрдо рд╕рдореАрдХреНрд╖рд╛ рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИ

рдЗрд╕реЗ рдмрд╛рдпрдкрд╛рд╕ рдХрд░рдиреЗ рдХреЗ рдмрд╛рдж, рдЖрдк рдЕрдкрдиреЗ рдкреНрд░рд╛рд░рдВрднрд┐рдХ рд╕реЗрдЯрдЕрдк рдкрд░ рд╡рд╛рдкрд╕ рдЬрд╛ рд╕рдХрддреЗ рд╣реИрдВ рдФрд░ рдЖрдкрдХреЗ рдкрд╛рд╕ рдЕрднреА рднреА access рд╣реЛрдЧрд╛ред

### Subdomain Takeover

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Whoami

{% hint style="danger" %}
рдЬрд╛рдиреЗрдВ **рдХреИрд╕реЗ рд╕реНрдерд╛рдкрд┐рдд рдХрд░реЗрдВ** az cli, AzureAD рдФрд░ Az PowerShell [**Az - AzureAD**](az-azuread/) рдЕрдиреБрднрд╛рдЧ рдореЗрдВред
{% endhint %}

рдкрд╣рд▓реА рдЪреАрдЬреЛрдВ рдореЗрдВ рд╕реЗ рдПрдХ рдЬреЛ рдЖрдкрдХреЛ рдЬрд╛рдирдиреЗ рдХреА рдЖрд╡рд╢реНрдпрдХрддрд╛ рд╣реИ рд╡рд╣ рд╣реИ **рдЖрдк рдХреМрди рд╣реИрдВ** (рдЖрдк рдХрд┐рд╕ environment рдореЗрдВ рд╣реИрдВ):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
Azure рдХреЛ enumerate рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рд╕рдмрд╕реЗ рдорд╣рддреНрд╡рдкреВрд░реНрдг commands рдореЗрдВ рд╕реЗ рдПрдХ рд╣реИ **`Get-AzResource`** Az PowerShell рд╕реЗ, рдХреНрдпреЛрдВрдХрд┐ рдпрд╣ рдЖрдкрдХреЛ **рдЙрди resources рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ рдЬрд╛рдирдиреЗ рджреЗрддрд╛ рд╣реИ рдЬрд┐рди рдкрд░ рдЖрдкрдХреЗ рд╡рд░реНрддрдорд╛рди рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреА visibility рд╣реИ**ред

рдЖрдк **web console** рдореЗрдВ рдЬрд╛рдХрд░ рднреА рд╡рд╣реА рдЬрд╛рдирдХрд╛рд░реА рдкреНрд░рд╛рдкреНрдд рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) рдпрд╛ "All resources" рдЦреЛрдЬрдХрд░ред
{% endhint %}

### AzureAD Enumeration

рдбрд┐рдлрд╝реЙрд▓реНрдЯ рд░реВрдк рд╕реЗ, рдХрд┐рд╕реА рднреА рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЗ рдкрд╛рд╕ **рдкрд░реНрдпрд╛рдкреНрдд permissions рд╣реЛрдиреА рдЪрд╛рд╣рд┐рдП** рдЬреИрд╕реЗ рдХрд┐, users, groups, roles, service principals... (рджреЗрдЦреЗрдВ [default AzureAD permissions](az-basic-information.md#default-user-permissions))ред\
рдЖрдк рдпрд╣рд╛рдВ рдПрдХ рдЧрд╛рдЗрдб рдкрд╛ рд╕рдХрддреЗ рд╣реИрдВ:

{% content-ref url="az-azuread/" %}
[az-azuread](az-azuread/)
{% endcontent-ref %}

{% hint style="info" %}
рдЕрдм рдЬрдм рдЖрдкрдХреЗ рдкрд╛рд╕ **рдЕрдкрдиреЗ credentials рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ рдХреБрдЫ рдЬрд╛рдирдХрд╛рд░реА рд╣реИ** (рдФрд░ рдпрджрд┐ рдЖрдк red team рд╣реИрдВ рддреЛ рдЙрдореНрдореАрдж рд╣реИ рдХрд┐ рдЖрдк **рдкрддрд╛ рдирд╣реАрдВ рдЪрд▓реЗ рд╣реИрдВ**)ред рдЕрдм рдпрд╣ рдкрддрд╛ рд▓рдЧрд╛рдиреЗ рдХрд╛ рд╕рдордп рд╣реИ рдХрд┐ environment рдореЗрдВ рдХреМрди-рдХреМрди рд╕реА services рдЙрдкрдпреЛрдЧ рдХреА рдЬрд╛ рд░рд╣реА рд╣реИрдВред\
рдЕрдЧрд▓реЗ section рдореЗрдВ рдЖрдк рдХреБрдЫ рд╕рд╛рдорд╛рдиреНрдп services рдХреЛ **enumerate рдХрд░рдиреЗ рдХреЗ рдХреБрдЫ рддрд░реАрдХреЗ** рджреЗрдЦ рд╕рдХрддреЗ рд╣реИрдВред
{% endhint %}

## Service Principal рдФрд░ Access Policy

рдПрдХ Azure service рдХреЗ рдкрд╛рд╕ System Identity (service рд╕реНрд╡рдпрдВ рдХреА) рд╣реЛ рд╕рдХрддреА рд╣реИ рдпрд╛ User Assigned Managed Identity рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░ рд╕рдХрддреА рд╣реИред рдЗрд╕ Identity рдХреЗ рдкрд╛рд╕ Access Policy рд╣реЛ рд╕рдХрддреА рд╣реИ, рдЙрджрд╛рд╣рд░рдг рдХреЗ рд▓рд┐рдП, рдПрдХ KeyVault рд╕реЗ secrets рдкрдврд╝рдиреЗ рдХреЗ рд▓рд┐рдПред рдпреЗ Access Policies рд╕реАрдорд┐рдд рд╣реЛрдиреА рдЪрд╛рд╣рд┐рдП (least privilege principle), рд▓реЗрдХрд┐рди рдЗрдирдореЗрдВ рдЖрд╡рд╢реНрдпрдХ рд╕реЗ рдЕрдзрд┐рдХ permissions рд╣реЛ рд╕рдХрддреА рд╣реИрдВред рдЖрдорддреМрд░ рдкрд░ рдПрдХ App Service KeyVault рдХрд╛ рдЙрдкрдпреЛрдЧ secrets рдФрд░ certificates рдкреНрд░рд╛рдкреНрдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд░реЗрдЧреАред

рдЗрд╕рд▓рд┐рдП рдЗрди identities рдХреЛ explore рдХрд░рдирд╛ рдЙрдкрдпреЛрдЧреА рд╣реИред

## App Service SCM

App Service 'container' рдореЗрдВ рд▓реЙрдЧ рдЗрди рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП Kudu consoleред

## Webshell

portal.azure.com рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВ рдФрд░ shell рдЪреБрдиреЗрдВ, рдпрд╛ shell.azure.com рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВ, bash рдпрд╛ powershell рдХреЗ рд▓рд┐рдПред рдЗрд╕ shell рдХрд╛ 'disk' рдПрдХ image file рдХреЗ рд░реВрдк рдореЗрдВ storage-account рдореЗрдВ рд╕рдВрдЧреНрд░рд╣реАрдд рд╣реЛрддрд╛ рд╣реИред

## Azure DevOps

Azure DevOps Azure рд╕реЗ рдЕрд▓рдЧ рд╣реИред рдЗрд╕рдореЗрдВ repositories, pipelines (yaml рдпрд╛ release), boards, wiki, рдФрд░ рдЕрдзрд┐рдХ рд╣реЛрддреЗ рд╣реИрдВред Variable Groups рдХрд╛ рдЙрдкрдпреЛрдЧ variable values рдФрд░ secrets рдХреЛ рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИред

## Automated Recon Tools

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the тАШContributorтАЩ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [Azucar](https://github.com/nccgroup/azucar)

Azucar рдПрдХ Azure рд╕реБрд░рдХреНрд╖рд╛ рдСрдбрд┐рдЯрд┐рдВрдЧ рдЯреВрд▓ рд╣реИ рдЬреЛ Azure рд╕рдмреНрд╕рдХреНрд░рд┐рдкреНрд╢рди рдХреЗ рд╡рд┐рднрд┐рдиреНрди рдкрд╣рд▓реБрдУрдВ рдХрд╛ рдореВрд▓реНрдпрд╛рдВрдХрди рдХрд░рддрд╛ рд╣реИред рдпрд╣ рдЯреВрд▓ Azure рд╕рдВрд╕рд╛рдзрдиреЛрдВ рдХреА рд╕реБрд░рдХреНрд╖рд╛ рд╕реНрдерд┐рддрд┐ рдХреА рдЬрд╛рдВрдЪ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рд╡рд┐рднрд┐рдиреНрди рдореЙрдбреНрдпреВрд▓ рдкреНрд░рджрд╛рди рдХрд░рддрд╛ рд╣реИред
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)

PowerZure рдПрдХ PowerShell рд╕реНрдХреНрд░рд┐рдкреНрдЯ рд╣реИ рдЬреЛ Azure рдХреЗ рдЦрд┐рд▓рд╛рдл рд╡рд┐рднрд┐рдиреНрди рдХрд╛рд░реНрдпреЛрдВ рдХреЛ рдирд┐рд╖реНрдкрд╛рджрд┐рдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдЙрдкрдпреЛрдЧ рдХреА рдЬрд╛рддреА рд╣реИред рдпрд╣ рд╕реНрдХреНрд░рд┐рдкреНрдЯ Azure рдХреЗ рд╕рдВрд╕рд╛рдзрдиреЛрдВ рдХреЛ рд╕реВрдЪреАрдмрджреНрдз рдХрд░рдиреЗ, рдЬрд╛рдирдХрд╛рд░реА рдирд┐рдХрд╛рд▓рдиреЗ, рдФрд░ рд╕рдВрднрд╛рд╡рд┐рдд рдХрдордЬреЛрд░рд┐рдпреЛрдВ рдХрд╛ рдкрд░реАрдХреНрд╖рдг рдХрд░рдиреЗ рдореЗрдВ рдорджрдж рдХрд░рддреА рд╣реИред
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
{% hint style="success" %}
AWS Hacking рд╕реАрдЦреЗрдВ рдФрд░ рдЕрднреНрдпрд╛рд╕ рдХрд░реЗрдВ:<img src="/.gitbook/assets/image.png" alt="" data-size="line">[**HackTricks Training AWS Red Team Expert (ARTE)**](https://training.hacktricks.xyz/courses/arte)<img src="/.gitbook/assets/image.png" alt="" data-size="line">\
GCP Hacking рд╕реАрдЦреЗрдВ рдФрд░ рдЕрднреНрдпрд╛рд╕ рдХрд░реЗрдВ: <img src="/.gitbook/assets/image (2).png" alt="" data-size="line">[**HackTricks Training GCP Red Team Expert (GRTE)**<img src="/.gitbook/assets/image (2).png" alt="" data-size="line">](https://training.hacktricks.xyz/courses/grte)

<details>

<summary>HackTricks рдХреЛ рд╕рдорд░реНрдерди рджреЗрдВ</summary>

* [**subscription plans**](https://github.com/sponsors/carlospolop) рджреЗрдЦреЗрдВ!
* ЁЯТм [**Discord group**](https://discord.gg/hRep4RUj7f) рдпрд╛ [**telegram group**](https://t.me/peass) рдореЗрдВ рд╢рд╛рдорд┐рд▓ рд╣реЛрдВ рдпрд╛ **Twitter** ЁЯРж рдкрд░ рд╣рдореЗрдВ **рдлреЙрд▓реЛ рдХрд░реЗрдВ** [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **PRs рд╕рдмрдорд┐рдЯ рдХрд░рдХреЗ рд╣реИрдХрд┐рдВрдЧ рдЯреНрд░рд┐рдХреНрд╕ рд╕рд╛рдЭрд╛ рдХрд░реЗрдВ** [**HackTricks**](https://github.com/carlospolop/hacktricks) рдФрд░ [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos.

</details>
{% endhint %}
