# Azure Pentesting

{% hint style="success" %}
Jifunze na kufanya mazoezi ya AWS Hacking:<img src="/.gitbook/assets/image.png" alt="" data-size="line">[**HackTricks Training AWS Red Team Expert (ARTE)**](https://training.hacktricks.xyz/courses/arte)<img src="/.gitbook/assets/image.png" alt="" data-size="line">\
Jifunze na kufanya mazoezi ya GCP Hacking: <img src="/.gitbook/assets/image (2).png" alt="" data-size="line">[**HackTricks Training GCP Red Team Expert (GRTE)**<img src="/.gitbook/assets/image (2).png" alt="" data-size="line">](https://training.hacktricks.xyz/courses/grte)

<details>

<summary>Support HackTricks</summary>

* Angalia [**mipango ya usajili**](https://github.com/sponsors/carlospolop)!
* **Jiunge na** 💬 [**kikundi cha Discord**](https://discord.gg/hRep4RUj7f) au [**kikundi cha telegram**](https://t.me/peass) au **tufuate** kwenye **Twitter** 🐦 [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **Shiriki mbinu za udukuzi kwa kuwasilisha PRs kwenye** [**HackTricks**](https://github.com/carlospolop/hacktricks) na [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos.

</details>
{% endhint %}

## NINAENDELEA KUJENGA MBINU ZA AZURE

## Taarifa za Msingi

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Mbinu za Azure Pentester/Red Team

Ili kufanya ukaguzi wa mazingira ya AZURE ni muhimu sana kujua: ni **huduma zipi zinatumika**, nini **kinachofichuliwa**, nani ana **upatikanaji** wa nini, na jinsi huduma za ndani za Azure na **huduma za nje** zimeunganishwa.

Kutoka kwa mtazamo wa Red Team, **hatua ya kwanza ya kuathiri mazingira ya Azure** ni kupata **credentials** za Azure AD. Hapa kuna mawazo kadhaa ya jinsi ya kufanya hivyo:

* **Leaks** kwenye github (au sawa) - OSINT
* **Uhandisi wa Kijamii**
* **Matumizi ya nywila** (password leaks)
* Udhaifu katika Programu Zinazohifadhiwa na Azure
* [**Server Side Request Forgery**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) yenye upatikanaji wa metadata endpoint
* **Usomaji wa Faili za Ndani**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* Faili **`accessTokens.json`** katika `az cli` kabla ya 2.30 - Jan2022 - ilihifadhi **access tokens kwa maandishi wazi**
* Faili **`azureProfile.json`** ina **taarifa** kuhusu mtumiaji aliyesajiliwa.
* **`az logout`** huondoa token.
* Matoleo ya zamani ya **`Az PowerShell`** yalihifadhi **access tokens** kwa **maandishi wazi** katika **`TokenCache.dat`**. Pia inahifadhi **ServicePrincipalSecret** kwa **maandishi wazi** katika **`AzureRmContext.json`**. Cmdlet **`Save-AzContext`** inaweza kutumika **kuhifadhi** **tokens**.\
Tumia `Disconnect-AzAccount` kuondoa.
* Watu wa tatu **walioathirika**
* **Mfanyakazi wa Ndani**
* [**Phishing ya Kawaida**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (credentials au Oauth App)
* [Device Code Authentication Phishing](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [Azure **Password Spraying**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

Hata kama **hujaathiri mtumiaji yeyote** ndani ya tenant ya Azure unayoshambulia, unaweza **kukusanya taarifa fulani** kutoka kwake:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
Baada ya kufanikiwa kupata credentials, unahitaji kujua **credentials hizo ni za nani**, na **wana upatikanaji wa nini**, hivyo unahitaji kufanya baadhi ya uchunguzi wa msingi:
{% endhint %}

## Uchunguzi wa Msingi

{% hint style="info" %}
Kumbuka kwamba sehemu **yenye kelele zaidi** ya uchunguzi ni **kuingia**, si uchunguzi wenyewe.
{% endhint %}

### SSRF

Ikiwa umepata SSRF kwenye mashine ndani ya Azure angalia ukurasa huu kwa mbinu:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Kuepuka Masharti ya Kuingia

<figure><img src="../../.gitbook/assets/image (268).png" alt=""><figcaption></figcaption></figure>

Katika hali ambapo una credentials halali lakini huwezi kuingia, hizi ni baadhi ya ulinzi wa kawaida ambao unaweza kuwepo:

* **IP whitelisting** -- Unahitaji kuathiri IP halali
* **Vikwazo vya Kijiografia** -- Tafuta mahali mtumiaji anaishi au ofisi za kampuni ziko wapi na upate IP kutoka mji huo huo (au nchi angalau)
* **Kivinjari** -- Labda kivinjari kutoka OS fulani (Windows, Linux, Mac, Android, iOS) kinaruhusiwa. Tafuta ni OS gani mwathirika/kampuni wanatumia.
* Unaweza pia kujaribu **kuathiri credentials za Service Principal** kwani kawaida huwa na vikwazo vichache na kuingia kwake hakupitiwi sana

Baada ya kuepuka, unaweza kurudi kwenye mipangilio yako ya awali na bado utakuwa na upatikanaji.

### Subdomain Takeover

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Whoami

{% hint style="danger" %}
Jifunze **jinsi ya kusakinisha** az cli, AzureAD na Az PowerShell katika sehemu ya [**Az - AzureAD**](az-azuread/).
{% endhint %}

Moja ya mambo ya kwanza unayohitaji kujua ni **wewe ni nani** (uko katika mazingira gani):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% tab title="Az PowerShell" %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
Moja ya amri muhimu zaidi za kuorodhesha Azure ni **`Get-AzResource`** kutoka Az PowerShell kwani inakuruhusu **kujua rasilimali ambazo mtumiaji wako wa sasa anaonekana nazo**.

Unaweza kupata taarifa hiyo hiyo kwenye **web console** kwa kwenda [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) au kutafuta "All resources"
{% endhint %}

### AzureAD Enumeration

Kwa default, mtumiaji yeyote anapaswa kuwa na **ruhusa za kutosha kuorodhesha** vitu kama watumiaji, vikundi, majukumu, service principals... (angalia [default AzureAD permissions](az-basic-information.md#default-user-permissions)).\
Unaweza kupata mwongozo hapa:

{% content-ref url="az-azuread/" %}
[az-azuread](az-azuread/)
{% endcontent-ref %}

{% hint style="info" %}
Sasa kwa kuwa **una taarifa fulani kuhusu hati zako** (na kama wewe ni red team tunatumaini **hujagunduliwa**). Ni wakati wa kujua ni huduma gani zinatumika katika mazingira.\
Katika sehemu ifuatayo unaweza kuangalia njia kadhaa za **kuorodhesha huduma za kawaida.**
{% endhint %}

## Service Principal and Access Policy

Huduma ya Azure inaweza kuwa na System Identity (ya huduma yenyewe) au kutumia User Assigned Managed Identity. Utambulisho huu unaweza kuwa na Access Policy kwa, kwa mfano, KeyVault kusoma siri. Sera hizi za Upatikanaji zinapaswa kuwa na vikwazo (kanuni ya upendeleo mdogo), lakini zinaweza kuwa na ruhusa zaidi kuliko inavyohitajika. Kawaida App Service ingekuwa inatumia KeyVault kupata siri na vyeti.

Kwa hivyo ni muhimu kuchunguza utambulisho huu.

## App Service SCM

Kudu console kuingia kwenye 'container' ya App Service.

## Webshell

Tumia portal.azure.com na uchague shell, au tumia shell.azure.com, kwa bash au powershell. 'Disk' ya shell hii imehifadhiwa kama faili ya picha katika storage-account.

## Azure DevOps

Azure DevOps ni tofauti na Azure. Ina repositories, pipelines (yaml au release), boards, wiki, na zaidi. Variable Groups zinatumika kuhifadhi thamani za variable na siri.

## Automated Recon Tools

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the ‘Contributor’ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [Azucar](https://github.com/nccgroup/azucar)

`Azucar` ni chombo cha kutathmini usalama wa mazingira ya Azure. Inakusanya taarifa kuhusu akaunti ya Azure na inatoa ripoti juu ya hali ya usalama.

### [MicroBurst](https://github.com/NetSPI/MicroBurst)

`MicroBurst` ni mkusanyiko wa scripts za PowerShell zinazolenga kutambua na kutumia udhaifu katika mazingira ya Azure.

### [Stormspotter](https://github.com/Azure/Stormspotter)

`Stormspotter` ni chombo cha kutambua na kuchambua utegemezi wa rasilimali katika mazingira ya Azure. Inasaidia kuelewa jinsi rasilimali zinavyohusiana na jinsi udhaifu unaweza kuenea.

### [ROADtools](https://github.com/dirkjanm/ROADtools)

`ROADtools` ni seti ya zana za kuchunguza na kutumia Azure AD. Inajumuisha zana za kuchambua na kubadilisha data ya Azure AD.

### [AADInternals](https://github.com/Gerenios/AADInternals)

`AADInternals` ni moduli ya PowerShell inayotoa zana za kuchunguza na kutumia Azure AD na mazingira ya Office 365.
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)

PowerZure ni zana ya PowerShell kwa ajili ya pentesting ya Azure. Inatoa uwezo wa kufanya uchunguzi, kupata taarifa, na kufanya mashambulizi kwenye mazingira ya Azure.
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
{% hint style="success" %}
Jifunze na kufanya mazoezi ya AWS Hacking:<img src="/.gitbook/assets/image.png" alt="" data-size="line">[**HackTricks Training AWS Red Team Expert (ARTE)**](https://training.hacktricks.xyz/courses/arte)<img src="/.gitbook/assets/image.png" alt="" data-size="line">\
Jifunze na kufanya mazoezi ya GCP Hacking: <img src="/.gitbook/assets/image (2).png" alt="" data-size="line">[**HackTricks Training GCP Red Team Expert (GRTE)**<img src="/.gitbook/assets/image (2).png" alt="" data-size="line">](https://training.hacktricks.xyz/courses/grte)

<details>

<summary>Support HackTricks</summary>

* Angalia [**mipango ya usajili**](https://github.com/sponsors/carlospolop)!
* **Jiunge na** 💬 [**kikundi cha Discord**](https://discord.gg/hRep4RUj7f) au [**kikundi cha telegram**](https://t.me/peass) au **tufuate** kwenye **Twitter** 🐦 [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **Shiriki mbinu za udukuzi kwa kuwasilisha PRs kwenye** [**HackTricks**](https://github.com/carlospolop/hacktricks) na [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) repos za github.

</details>
{% endhint %}
