# Azure Pentesting

{% hint style="success" %}
Aprende y practica AWS Hacking:<img src="/.gitbook/assets/image.png" alt="" data-size="line">[**HackTricks Training AWS Red Team Expert (ARTE)**](https://training.hacktricks.xyz/courses/arte)<img src="/.gitbook/assets/image.png" alt="" data-size="line">\
Aprende y practica GCP Hacking: <img src="/.gitbook/assets/image (2).png" alt="" data-size="line">[**HackTricks Training GCP Red Team Expert (GRTE)**<img src="/.gitbook/assets/image (2).png" alt="" data-size="line">](https://training.hacktricks.xyz/courses/grte)

<details>

<summary>Apoya a HackTricks</summary>

* Revisa los [**planes de suscripción**](https://github.com/sponsors/carlospolop)!
* **Únete al** 💬 [**grupo de Discord**](https://discord.gg/hRep4RUj7f) o al [**grupo de telegram**](https://t.me/peass) o **síguenos** en **Twitter** 🐦 [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **Comparte trucos de hacking enviando PRs a los repositorios de github de** [**HackTricks**](https://github.com/carlospolop/hacktricks) y [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud).

</details>
{% endhint %}

## ESTOY AÚN CONSTRUYENDO LA METODOLOGÍA DE AZURE

## Información Básica

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Metodología de Pentester/Red Team en Azure

Para auditar un entorno de AZURE es muy importante saber: qué **servicios se están utilizando**, qué está **expuesto**, quién tiene **acceso** a qué, y cómo están conectados los servicios internos de Azure y los **servicios externos**.

Desde el punto de vista de un Red Team, el **primer paso para comprometer un entorno de Azure** es conseguir obtener algunas **credenciales** para Azure AD. Aquí tienes algunas ideas sobre cómo hacerlo:

* **Leaks** en github (o similar) - OSINT
* **Ingeniería** Social
* Reutilización de **contraseñas** (password leaks)
* Vulnerabilidades en Aplicaciones Alojadas en Azure
* [**Server Side Request Forgery**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) con acceso al endpoint de metadatos
* **Lectura de Archivos Locales**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* El archivo **`accessTokens.json`** en `az cli` antes de la versión 2.30 - Ene2022 - almacenaba **tokens de acceso en texto claro**
* El archivo **`azureProfile.json`** contiene **información** sobre el usuario conectado.
* **`az logout`** elimina el token.
* Versiones anteriores de **`Az PowerShell`** almacenaban **tokens de acceso** en **texto claro** en **`TokenCache.dat`**. También almacena **ServicePrincipalSecret** en **texto claro** en **`AzureRmContext.json`**. El cmdlet **`Save-AzContext`** puede ser usado para **almacenar** **tokens**.\
Usa `Disconnect-AzAccount` para eliminarlos.
* 3ras partes **comprometidas**
* Empleado **interno**
* [**Phishing Común**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (credenciales o App Oauth)
* [Device Code Authentication Phishing](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [Azure **Password Spraying**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

Incluso si **no has comprometido a ningún usuario** dentro del tenant de Azure que estás atacando, puedes **recopilar algo de información** de él:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
Después de haber conseguido credenciales, necesitas saber **a quién pertenecen esas credenciales**, y **a qué tienen acceso**, por lo que necesitas realizar una enumeración básica:
{% endhint %}

## Enumeración Básica

{% hint style="info" %}
Recuerda que la parte **más ruidosa** de la enumeración es el **inicio de sesión**, no la enumeración en sí.
{% endhint %}

### SSRF

Si encontraste un SSRF en una máquina dentro de Azure, revisa esta página para trucos:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Bypass de Condiciones de Inicio de Sesión

<figure><img src="../../.gitbook/assets/image (268).png" alt=""><figcaption></figcaption></figure>

En casos donde tienes algunas credenciales válidas pero no puedes iniciar sesión, estas son algunas protecciones comunes que podrían estar en su lugar:

* **Lista blanca de IPs** -- Necesitas comprometer una IP válida
* **Restricciones geográficas** -- Averigua dónde vive el usuario o dónde están las oficinas de la empresa y consigue una IP de la misma ciudad (o al menos del mismo país)
* **Navegador** -- Tal vez solo se permite un navegador de cierto SO (Windows, Linux, Mac, Android, iOS). Averigua qué SO usa la víctima/empresa.
* También puedes intentar **comprometer credenciales de Service Principal** ya que usualmente están menos limitadas y su inicio de sesión es menos revisado

Después de evitarlo, podrías volver a tu configuración inicial y aún tendrás acceso.

### Subdomain Takeover

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Whoami

{% hint style="danger" %}
Aprende **cómo instalar** az cli, AzureAD y Az PowerShell en la sección [**Az - AzureAD**](az-azuread/).
{% endhint %}

Una de las primeras cosas que necesitas saber es **quién eres** (en qué entorno estás):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
Uno de los comandos más importantes para enumerar Azure es **`Get-AzResource`** de Az PowerShell, ya que te permite **conocer los recursos sobre los que tu usuario actual tiene visibilidad**.

Puedes obtener la misma información en la **consola web** yendo a [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) o buscando "All resources"
{% endhint %}

### Enumeración de AzureAD

Por defecto, cualquier usuario debería tener **suficientes permisos para enumerar** cosas como usuarios, grupos, roles, service principals... (consulta [permisos predeterminados de AzureAD](az-basic-information.md#default-user-permissions)).\
Aquí puedes encontrar una guía:

{% content-ref url="az-azuread/" %}
[az-azuread](az-azuread/)
{% endcontent-ref %}

{% hint style="info" %}
Ahora que **tienes algo de información sobre tus credenciales** (y si eres un red team, con suerte **no has sido detectado**). Es hora de averiguar qué servicios se están utilizando en el entorno.\
En la siguiente sección puedes revisar algunas formas de **enumerar algunos servicios comunes.**
{% endhint %}

## Service Principal y Política de Acceso

Un servicio de Azure puede tener una Identidad del Sistema (del propio servicio) o usar una Identidad Administrada Asignada por el Usuario. Esta Identidad puede tener una Política de Acceso a, por ejemplo, un KeyVault para leer secretos. Estas Políticas de Acceso deben estar restringidas (principio de privilegio mínimo), pero podrían tener más permisos de los necesarios. Típicamente, un App Service usaría KeyVault para recuperar secretos y certificados.

Por lo tanto, es útil explorar estas identidades.

## App Service SCM

Consola Kudu para iniciar sesión en el 'contenedor' del App Service.

## Webshell

Usa portal.azure.com y selecciona el shell, o usa shell.azure.com, para un bash o powershell. El 'disco' de este shell se almacena como un archivo de imagen en una storage-account.

## Azure DevOps

Azure DevOps está separado de Azure. Tiene repositorios, pipelines (yaml o release), tableros, wiki y más. Los Grupos de Variables se utilizan para almacenar valores de variables y secretos.

## Herramientas de Recon Automatizadas

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the ‘Contributor’ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [Azucar](https://github.com/nccgroup/azucar)

Azucar es una herramienta de auditoría de seguridad para Azure. Proporciona una forma automatizada de evaluar la configuración de seguridad de una suscripción de Azure.
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
{% hint style="success" %}
Aprende y practica AWS Hacking:<img src="/.gitbook/assets/image.png" alt="" data-size="line">[**HackTricks Training AWS Red Team Expert (ARTE)**](https://training.hacktricks.xyz/courses/arte)<img src="/.gitbook/assets/image.png" alt="" data-size="line">\
Aprende y practica GCP Hacking: <img src="/.gitbook/assets/image (2).png" alt="" data-size="line">[**HackTricks Training GCP Red Team Expert (GRTE)**<img src="/.gitbook/assets/image (2).png" alt="" data-size="line">](https://training.hacktricks.xyz/courses/grte)

<details>

<summary>Apoya HackTricks</summary>

* Revisa los [**planes de suscripción**](https://github.com/sponsors/carlospolop)!
* **Únete al** 💬 [**grupo de Discord**](https://discord.gg/hRep4RUj7f) o al [**grupo de telegram**](https://t.me/peass) o **síguenos** en **Twitter** 🐦 [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **Comparte trucos de hacking enviando PRs a los repositorios de github de** [**HackTricks**](https://github.com/carlospolop/hacktricks) y [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud).

</details>
{% endhint %}
