# Azure Pentesting

{% hint style="success" %}
Leer & oefen AWS Hacking:<img src="/.gitbook/assets/image.png" alt="" data-size="line">[**HackTricks Training AWS Red Team Expert (ARTE)**](https://training.hacktricks.xyz/courses/arte)<img src="/.gitbook/assets/image.png" alt="" data-size="line">\
Leer & oefen GCP Hacking: <img src="/.gitbook/assets/image (2).png" alt="" data-size="line">[**HackTricks Training GCP Red Team Expert (GRTE)**<img src="/.gitbook/assets/image (2).png" alt="" data-size="line">](https://training.hacktricks.xyz/courses/grte)

<details>

<summary>Ondersteun HackTricks</summary>

* Kyk na die [**intekenplanne**](https://github.com/sponsors/carlospolop)!
* **Sluit aan by die** 💬 [**Discord groep**](https://discord.gg/hRep4RUj7f) of die [**telegram groep**](https://t.me/peass) of **volg** ons op **Twitter** 🐦 [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **Deel hacking truuks deur PRs in te dien by die** [**HackTricks**](https://github.com/carlospolop/hacktricks) en [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos.

</details>
{% endhint %}

## EK BOU NOG DIE AZURE METODOLOGIE

## Basiese Inligting

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Azure Pentester/Red Team Metodologie

Om 'n AZURE-omgewing te oudit, is dit baie belangrik om te weet: watter **dienste gebruik word**, wat **blootgestel word**, wie het **toegang** tot wat, en hoe interne Azure-dienste en **eksterne dienste** gekoppel is.

Vanuit 'n Red Team oogpunt, die **eerste stap om 'n Azure-omgewing te kompromitteer** is om te slaag om sommige **geloofsbriewe** vir Azure AD te bekom. Hier is 'n paar idees oor hoe om dit te doen:

* **Leaks** in github (of soortgelyk) - OSINT
* **Sosiale** Ingenieurswese
* **Wagwoord** hergebruik (wagwoord leaks)
* Kwesbaarhede in Azure-gehoste toepassings
* [**Server Side Request Forgery**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) met toegang tot metadata eindpunt
* **Lokaal Lêer Lees**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* Die lêer **`accessTokens.json`** in `az cli` voor 2.30 - Jan2022 - het **toegangstekens in duidelike teks** gestoor
* Die lêer **`azureProfile.json`** bevat **inligting** oor aangemelde gebruiker.
* **`az logout`** verwyder die teken.
* Ouer weergawes van **`Az PowerShell`** het **toegangstekens** in **duidelike** teks in **`TokenCache.dat`** gestoor. Dit stoor ook **ServicePrincipalSecret** in **duidelike** teks in **`AzureRmContext.json`**. Die cmdlet **`Save-AzContext`** kan gebruik word om **tekens** te **stoor**.\
Gebruik `Disconnect-AzAccount` om hulle te verwyder.
* 3de partye **gekompromitteer**
* **Interne** Werknemer
* [**Algemene Phishing**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (geloofsbriewe of Oauth App)
* [Device Code Authentication Phishing](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [Azure **Password Spraying**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

Selfs al het jy **geen gebruiker gekompromitteer** binne die Azure-tenant wat jy aanval nie, kan jy **sommige inligting versamel** daaruit:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
Nadat jy daarin geslaag het om geloofsbriewe te bekom, moet jy weet **aan wie behoort daardie geloofsbriewe**, en **waartoe hulle toegang het**, so jy moet 'n paar basiese enumerasie uitvoer:
{% endhint %}

## Basiese Enumerasie

{% hint style="info" %}
Onthou dat die **luidrugtigste** deel van die enumerasie die **aanmelding** is, nie die enumerasie self nie.
{% endhint %}

### SSRF

As jy 'n SSRF in 'n masjien binne Azure gevind het, kyk na hierdie bladsy vir truuks:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Omseil Aanmeldingsvoorwaardes

<figure><img src="../../.gitbook/assets/image (268).png" alt=""><figcaption></figcaption></figure>

In gevalle waar jy 'n paar geldige geloofsbriewe het, maar jy kan nie aanmeld nie, is hier 'n paar algemene beskermings wat in plek kan wees:

* **IP witlys** -- Jy moet 'n geldige IP kompromitteer
* **Geo beperkings** -- Vind uit waar die gebruiker woon of waar die kantore van die maatskappy is en kry 'n IP van dieselfde stad (of land ten minste)
* **Blaaier** -- Miskien word slegs 'n blaaier van sekere OS (Windows, Linux, Mac, Android, iOS) toegelaat. Vind uit watter OS die slagoffer/maatskappy gebruik.
* Jy kan ook probeer om **Service Principal geloofsbriewe te kompromitteer** aangesien hulle gewoonlik minder beperk is en hul aanmelding minder nagegaan word

Na die omseiling daarvan, kan jy dalk terugkeer na jou aanvanklike opstelling en jy sal steeds toegang hê.

### Subdomein Oorname

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Whoami

{% hint style="danger" %}
Leer **hoe om te installeer** az cli, AzureAD en Az PowerShell in die [**Az - AzureAD**](az-azuread/) afdeling.
{% endhint %}

Een van die eerste dinge wat jy moet weet, is **wie jy is** (in watter omgewing jy is):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
Een van die belangrikste opdragte om Azure te enumerate is **`Get-AzResource`** van Az PowerShell aangesien dit jou toelaat om **die hulpbronne te ken waaroor jou huidige gebruiker sigbaarheid het**.

Jy kan dieselfde inligting in die **webkonsole** kry deur te gaan na [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) of te soek vir "All resources"
{% endhint %}

### AzureAD Enumerasie

Enige gebruiker behoort standaard **genoeg regte te hê om** dinge soos gebruikers, groepe, rolle, diensprincipale te enumerate... (kyk [standaard AzureAD regte](az-basic-information.md#default-user-permissions)).\
Jy kan hier 'n gids vind:

{% content-ref url="az-azuread/" %}
[az-azuread](az-azuread/)
{% endcontent-ref %}

{% hint style="info" %}
Nou dat jy **'n bietjie inligting oor jou geloofsbriewe het** (en as jy 'n rooi span is, hopelik **is jy nie opgespoor nie**). Dit is tyd om uit te vind watter dienste in die omgewing gebruik word.\
In die volgende afdeling kan jy 'n paar maniere nagaan om **'n paar algemene dienste te enumerate.**
{% endhint %}

## Diensprincipaal en Toegangsbeleid

'n Azure-diens kan 'n Stelselidentiteit (van die diens self) hê of 'n Gebruiker Toegewyde Bestuurde Identiteit gebruik. Hierdie Identiteit kan 'n Toegangsbeleid hê om, byvoorbeeld, 'n KeyVault te lees om geheime te lees. Hierdie Toegangsbeleide moet beperk wees (minste voorreg beginsel), maar kan meer regte hê as wat nodig is. Tipies sou 'n App Service KeyVault gebruik om geheime en sertifikate te herwin.

Dit is dus nuttig om hierdie identiteite te verken.

## App Service SCM

Kudu-konsole om by die App Service 'container' aan te meld.

## Webshell

Gebruik portal.azure.com en kies die dop, of gebruik shell.azure.com, vir 'n bash of powershell. Die 'skyf' van hierdie dop word as 'n beeldlêer in 'n stoorrekening gestoor.

## Azure DevOps

Azure DevOps is apart van Azure. Dit het bewaarplekke, pypleidings (yaml of vrystelling), borde, wiki, en meer. Veranderlike Groepe word gebruik om veranderlike waardes en geheime te stoor.

## Outomatiese Recon Gereedskap

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)

AzureHound is 'n hulpmiddel wat gebruik word om inligting oor 'n Azure-omgewing in te samel en te analiseer. Dit help pentesters om sekuriteitskwesies en swakpunte binne 'n Azure-opstelling te identifiseer.
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the ‘Contributor’ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [Azucar](https://github.com/nccgroup/azucar)

Azucar is 'n instrument wat ontwerp is om sekuriteitskonfigurasies in 'n Azure-omgewing te assesseer. Dit verskaf 'n omvattende oorsig van 'n organisasie se Azure-sekuriteitsposisie deur verskeie kontroles uit te voer en die resultate in 'n maklik leesbare formaat te verskaf.

### [MicroBurst](https://github.com/NetSPI/MicroBurst)

MicroBurst bevat 'n versameling van PowerShell-skrifte wat gebruik kan word om gemeenskaplike misconfiguraties binne Azure te ontdek. Hierdie skripte kan gebruik word om sekuriteitskontroles uit te voer, data te onttrek, en sekuriteitskwessies binne 'n Azure-omgewing te identifiseer.

### [Stormspotter](https://github.com/Azure/Stormspotter)

Stormspotter is 'n instrument wat ontwerp is om die aanvalsvlak van 'n Azure-omgewing te visualiseer. Dit versamel data oor die verskillende komponente binne 'n Azure-omgewing en skep 'n grafiek wat die verhoudings tussen hierdie komponente toon. Hierdie grafiek kan gebruik word om potensiële aanvalspaaie te identifiseer en sekuriteitskwessies aan te spreek.
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)

PowerZure is 'n PowerShell-skrip wat ontwerp is om te help met die evaluering van die sekuriteit van 'n Azure-omgewing. Dit bied verskeie funksies om inligting te versamel, kwesbaarhede te identifiseer en aanvalle uit te voer.

### Kenmerke

- **Inligtingversameling**: Versamel besonderhede oor die Azure-omgewing, insluitend rekeninge, rolle, en regte.
- **Kwesbaarheidsidentifikasie**: Soek na algemene misconfiguraties en sekuriteitskwesbaarhede.
- **Aanvalle**: Voer verskeie aanvalle uit om die sekuriteit van die Azure-omgewing te toets.

### Gebruik

1. **Laai PowerZure af**: Klone die PowerZure-bewaarplek vanaf GitHub.
2. **Voer die skrip uit**: Begin die PowerZure-skrip met PowerShell.
3. **Kies 'n opsie**: Kies die verlangde funksie om inligting te versamel, kwesbaarhede te identifiseer, of aanvalle uit te voer.

### Voorbeeld

```powershell
# Klone die PowerZure-bewaarplek
git clone https://github.com/hausec/PowerZure.git

# Navigeer na die PowerZure-lêergids
cd PowerZure

# Voer die PowerZure-skrip uit
.\PowerZure.ps1
```

PowerZure is 'n kragtige hulpmiddel vir pentesters en sekuriteitsnavorsers wat die sekuriteit van Azure-omgewings wil evalueer.
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
{% hint style="success" %}
Leer & oefen AWS Hacking:<img src="/.gitbook/assets/image.png" alt="" data-size="line">[**HackTricks Training AWS Red Team Expert (ARTE)**](https://training.hacktricks.xyz/courses/arte)<img src="/.gitbook/assets/image.png" alt="" data-size="line">\
Leer & oefen GCP Hacking: <img src="/.gitbook/assets/image (2).png" alt="" data-size="line">[**HackTricks Training GCP Red Team Expert (GRTE)**<img src="/.gitbook/assets/image (2).png" alt="" data-size="line">](https://training.hacktricks.xyz/courses/grte)

<details>

<summary>Ondersteun HackTricks</summary>

* Kyk na die [**intekenplanne**](https://github.com/sponsors/carlospolop)!
* **Sluit aan by die** 💬 [**Discord groep**](https://discord.gg/hRep4RUj7f) of die [**telegram groep**](https://t.me/peass) of **volg** ons op **Twitter** 🐦 [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **Deel hacking tricks deur PRs in te dien by die** [**HackTricks**](https://github.com/carlospolop/hacktricks) en [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos.

</details>
{% endhint %}
